{-# LANGUAGE NoImplicitPrelude #-}
{-# LANGUAGE OverloadedStrings #-}
{-# LANGUAGE PackageImports    #-}
{-# LANGUAGE UnicodeSyntax     #-}

{-|
[@ISO639-1@]        -

[@ISO639-2B@]       -

[@ISO639-3@]        clm

[@Native name@]     nəxʷsƛ̕ay̕əmúcən

[@English name@]    Klallam
-}

module Text.Numeral.Language.CLM.TestData (cardinals) where


--------------------------------------------------------------------------------
-- Imports
--------------------------------------------------------------------------------

import "base" Data.String ( IsString )
import "base" Prelude     ( Num )
import "numerals-base" Text.Numeral.Grammar.Reified ( defaultInflection )
import "this" Text.Numeral.Test ( TestData )

--------------------------------------------------------------------------------
-- Test data
--------------------------------------------------------------------------------

cardinals ∷ (Num i, IsString s) ⇒ TestData i s
cardinals =
  [ ( "default"
    , defaultInflection
    , [ (1, "nə́c̕uʔ")
      , (2, "čə́saʔ")
      , (3, "ɬíxʷ")
      , (4, "ŋús")
      , (5, "ɬq̕áčš")
      , (6, "t̕x̣ə́ŋ")
      , (7, "c̕úʔkʷs")
      , (8, "táʔcs")
      , (9, "tə́kʷxʷ")
      , (10, "ʔúpən")
      , (11, "ʔúpən ʔiʔ nə́c̕uʔ")
      , (12, "ʔúpən ʔiʔ čə́saʔ")
      , (13, "ʔúpən ʔiʔ ɬíxʷ")
      , (14, "ʔúpən ʔiʔ ŋús")
      , (15, "ʔúpən ʔiʔ ɬq̕áčš")
      , (16, "ʔúpən ʔiʔ t̕x̣ə́ŋ")
      , (17, "ʔúpən ʔiʔ c̕úʔkʷs")
      , (18, "ʔúpən ʔiʔ táʔcs")
      , (19, "ʔúpən ʔiʔ tə́kʷxʷ")
      , (20, "nəc̕xʷk̕ʷə́s")
      , (21, "nəc̕xʷk̕ʷə́s ʔiʔ nə́c̕uʔ")
      , (22, "nəc̕xʷk̕ʷə́s ʔiʔ čə́saʔ")
      , (23, "nəc̕xʷk̕ʷə́s ʔiʔ ɬíxʷ")
      , (24, "nəc̕xʷk̕ʷə́s ʔiʔ ŋús")
      , (25, "nəc̕xʷk̕ʷə́s ʔiʔ ɬq̕áčš")
      , (26, "nəc̕xʷk̕ʷə́s ʔiʔ t̕x̣ə́ŋ")
      , (27, "nəc̕xʷk̕ʷə́s ʔiʔ c̕úʔkʷs")
      , (28, "nəc̕xʷk̕ʷə́s ʔiʔ táʔcs")
      , (29, "nəc̕xʷk̕ʷə́s ʔiʔ tə́kʷxʷ")
      , (30, "ɬxʷɬšáʔ")
      , (31, "ɬxʷɬšáʔ ʔiʔ nə́c̕uʔ")
      , (32, "ɬxʷɬšáʔ ʔiʔ čə́saʔ")
      , (33, "ɬxʷɬšáʔ ʔiʔ ɬíxʷ")
      , (34, "ɬxʷɬšáʔ ʔiʔ ŋús")
      , (35, "ɬxʷɬšáʔ ʔiʔ ɬq̕áčš")
      , (36, "ɬxʷɬšáʔ ʔiʔ t̕x̣ə́ŋ")
      , (37, "ɬxʷɬšáʔ ʔiʔ c̕úʔkʷs")
      , (38, "ɬxʷɬšáʔ ʔiʔ táʔcs")
      , (39, "ɬxʷɬšáʔ ʔiʔ tə́kʷxʷ")
      , (40, "ŋəsɬšáʔ")
      , (41, "ŋəsɬšáʔ ʔiʔ nə́c̕uʔ")
      , (42, "ŋəsɬšáʔ ʔiʔ čə́saʔ")
      , (43, "ŋəsɬšáʔ ʔiʔ ɬíxʷ")
      , (44, "ŋəsɬšáʔ ʔiʔ ŋús")
      , (45, "ŋəsɬšáʔ ʔiʔ ɬq̕áčš")
      , (46, "ŋəsɬšáʔ ʔiʔ t̕x̣ə́ŋ")
      , (47, "ŋəsɬšáʔ ʔiʔ c̕úʔkʷs")
      , (48, "ŋəsɬšáʔ ʔiʔ táʔcs")
      , (49, "ŋəsɬšáʔ ʔiʔ tə́kʷxʷ")
      , (50, "ɬq̕čšɬšáʔ")
      , (51, "ɬq̕čšɬšáʔ ʔiʔ nə́c̕uʔ")
      , (52, "ɬq̕čšɬšáʔ ʔiʔ čə́saʔ")
      , (53, "ɬq̕čšɬšáʔ ʔiʔ ɬíxʷ")
      , (54, "ɬq̕čšɬšáʔ ʔiʔ ŋús")
      , (55, "ɬq̕čšɬšáʔ ʔiʔ ɬq̕áčš")
      , (56, "ɬq̕čšɬšáʔ ʔiʔ t̕x̣ə́ŋ")
      , (57, "ɬq̕čšɬšáʔ ʔiʔ c̕úʔkʷs")
      , (58, "ɬq̕čšɬšáʔ ʔiʔ táʔcs")
      , (59, "ɬq̕čšɬšáʔ ʔiʔ tə́kʷxʷ")
      , (60, "t̕x̣əŋɬšáʔ")
      , (61, "t̕x̣əŋɬšáʔ ʔiʔ nə́c̕uʔ")
      , (62, "t̕x̣əŋɬšáʔ ʔiʔ čə́saʔ")
      , (63, "t̕x̣əŋɬšáʔ ʔiʔ ɬíxʷ")
      , (64, "t̕x̣əŋɬšáʔ ʔiʔ ŋús")
      , (65, "t̕x̣əŋɬšáʔ ʔiʔ ɬq̕áčš")
      , (66, "t̕x̣əŋɬšáʔ ʔiʔ t̕x̣ə́ŋ")
      , (67, "t̕x̣əŋɬšáʔ ʔiʔ c̕úʔkʷs")
      , (68, "t̕x̣əŋɬšáʔ ʔiʔ táʔcs")
      , (69, "t̕x̣əŋɬšáʔ ʔiʔ tə́kʷxʷ")
      , (70, "c̕aʔkʷsɬšáʔ")
      , (71, "c̕aʔkʷsɬšáʔ ʔiʔ nə́c̕uʔ")
      , (72, "c̕aʔkʷsɬšáʔ ʔiʔ čə́saʔ")
      , (73, "c̕aʔkʷsɬšáʔ ʔiʔ ɬíxʷ")
      , (74, "c̕aʔkʷsɬšáʔ ʔiʔ ŋús")
      , (75, "c̕aʔkʷsɬšáʔ ʔiʔ ɬq̕áčš")
      , (76, "c̕aʔkʷsɬšáʔ ʔiʔ t̕x̣ə́ŋ")
      , (77, "c̕aʔkʷsɬšáʔ ʔiʔ c̕úʔkʷs")
      , (78, "c̕aʔkʷsɬšáʔ ʔiʔ táʔcs")
      , (79, "c̕aʔkʷsɬšáʔ ʔiʔ tə́kʷxʷ")
      , (80, "taʔcsɬšáʔ")
      , (81, "taʔcsɬšáʔ ʔiʔ nə́c̕uʔ")
      , (82, "taʔcsɬšáʔ ʔiʔ čə́saʔ")
      , (83, "taʔcsɬšáʔ ʔiʔ ɬíxʷ")
      , (84, "taʔcsɬšáʔ ʔiʔ ŋús")
      , (85, "taʔcsɬšáʔ ʔiʔ ɬq̕áčš")
      , (86, "taʔcsɬšáʔ ʔiʔ t̕x̣ə́ŋ")
      , (87, "taʔcsɬšáʔ ʔiʔ c̕úʔkʷs")
      , (88, "taʔcsɬšáʔ ʔiʔ táʔcs")
      , (89, "taʔcsɬšáʔ ʔiʔ tə́kʷxʷ")
      , (90, "təkʷxʷɬšáʔ")
      , (91, "təkʷxʷɬšáʔ ʔiʔ nə́c̕uʔ")
      , (92, "təkʷxʷɬšáʔ ʔiʔ čə́saʔ")
      , (93, "təkʷxʷɬšáʔ ʔiʔ ɬíxʷ")
      , (94, "təkʷxʷɬšáʔ ʔiʔ ŋús")
      , (95, "təkʷxʷɬšáʔ ʔiʔ ɬq̕áčš")
      , (96, "təkʷxʷɬšáʔ ʔiʔ t̕x̣ə́ŋ")
      , (97, "təkʷxʷɬšáʔ ʔiʔ c̕úʔkʷs")
      , (98, "təkʷxʷɬšáʔ ʔiʔ táʔcs")
      , (99, "təkʷxʷɬšáʔ ʔiʔ tə́kʷxʷ")
      , (100, "snáč̕əwəč")
      , (101, "snáč̕əwəč ʔiʔ nə́c̕uʔ")
      , (107, "snáč̕əwəč ʔiʔ c̕úʔkʷs")
      , (123, "snáč̕əwəč ʔiʔ nəc̕xʷk̕ʷə́s ʔiʔ ɬíxʷ")
      , (199, "snáč̕əwəč ʔiʔ təkʷxʷɬšáʔ ʔiʔ tə́kʷxʷ")
      , (200, "čə́saʔ snáč̕əwəč")
      , (201, "čə́saʔ snáč̕əwəč ʔiʔ nə́c̕uʔ")
      , (207, "čə́saʔ snáč̕əwəč ʔiʔ c̕úʔkʷs")
      , (321, "ɬíxʷ snáč̕əwəč ʔiʔ nəc̕xʷk̕ʷə́s ʔiʔ nə́c̕uʔ")
      , (909, "tə́kʷxʷ snáč̕əwəč ʔiʔ tə́kʷxʷ")
      , (990, "tə́kʷxʷ snáč̕əwəč ʔiʔ təkʷxʷɬšáʔ")
      , (999, "tə́kʷxʷ snáč̕əwəč ʔiʔ təkʷxʷɬšáʔ ʔiʔ tə́kʷxʷ")
      , (1000, "ʔúpən snáč̕əwəč")
      ]
    )
  ]
